Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་བས་ན་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་རྩེ་བ་བརྒྱ་སྟོང་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ་ཞེས་བྱའོ།
en: Therefore, it says that they are “skillful in accomplishing a hundred thousand feats through meditative concentration.”

source: །དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའི་སྐུ་ནི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་དང་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་སོ།
en: Thus, the magically created body of the Tathāgata dwelt at Rājagṛha with the monks, nuns, laymen, and laywomen.

source: །དེ་བཞིན་གཤེགས་པ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ནི་ཞབས་རིང་བ་བྱང་ཆུབ་སེམས་དཔའ་དང་བཞུགས་པར་བསྟན་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཉིས་ཀྱི་འཁོར་ཉེ་བར་བསྟན་ཏེ།
en: As for the complete enjoyment body of the Tathāgata, it dwells with the bodhisattvas who are serving it, so it has given an exposition of the retinues of the two tathāgata bodies.

source: མདོ་སྡེ་ཐམས་ཅད་ཀྱི་སྤྱིའི་གླེང་གཞི་རྫོགས་པར་བསྟན་ནས། ད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་བཤད་པ་ལ། གླེང་གཞིའི་ཁྱད་པར་བསྟན་པའི་ཕྱིར། དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་གདན་སེང་གེའི་ཁྲི་བཤམས་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Introduction unique to the Perfection of Wisdom Having fully taught the introduction common to all sūtras, now, to teach the special feature of the introduction when this perfection of wisdom is being explained, it says: Thereupon the Lord, having himself arranged the lion throne, and so on.

source: །གདན་བཤམས་པ་འདི་ཡང་རྣམ་པ་གཉིས་ཏེ། སེང་གེའི་ཁྲི་བཤམས་པ་དང་། སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་པ་བཤམས་པའོ།
en: The arrangement of the seating posture has two parts: the arrangement of the lion throne, and the arrangement of the cross-legged posture. “

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་གདན་སེང་གེའི་ཁྲི་བཤམས་ནས་ཞེས་བྱ་བ་ནི་སེང་གེའི་ཁྲི་བསྟན་ཏོ།
en: Thereupon the Lord, having himself arranged the lion throne” teaches the lion throne.

source: །སྐུ་དྲང་པོར་བསྲང་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་པ་བསྟན་ཏོ།
en: Sat down with his legs crossed, holding his body erect, and so on, teaches the cross-legged posture.

source: །ཅིའི་ཕྱིར་ན་ཉིད་ཀྱིས་སེང་གེའི་ཁྲི་བཤམས་ཤེ་ན།
en: Why does he himself arrange the lion throne?

source: རྣམ་པ་གཉིས་ཀྱི་ཕྱིར་ཏེ། བཤད་པ་ཐུན་མོང་མ་ཡིན་པའི་མཆོད་འོས་ཆེན་པོར་བསྟན་པ་དང་། འཁོར་རྣམས་འདུལ་བའི་ཕྱིར་ཏེ།
en: Because of two things: he does so to demonstrate that a unique discourse is greatly worthy of worship, and he does so to tame the retinues.

source: དེ་ནི་འདི་ལྟར་ཇི་སྐད་དུ། མདོ་སྡེ་མང་པོ་གཞན་དག་ལས། བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་ལྡན་པ་སྟོན་ན་ནི་ཉན་ཐོས་ཀྱིས་གདན་བཤམས་པ་ལ་བཞུགས། ཐེག་པ་ཆེན་པོ་དང་ལྡན་པ་སྟོན་ན་ནི། བྱང་ཆུབ་སེམས་དཔས་གདན་བཤམས་པ་ལ་བཞུགས་སོ་ཞེས་གསུངས་པ་ལྟ་བུའོ།
en: In many other sūtras it is as follows: they say that when the Lord is teaching to those in the Śrāvaka Vehicle he sits on a seat arranged by śrāvakas; when teaching to those in the Great Vehicle he sits on a seat arranged by bodhisattvas.

source: །ཆོས་འདི་བཤད་པ་ནི་ཉིད་ཀྱིས་གདན་བཤམས་པ་ནི་བཤད་པ་འདི་ཐུན་མོང་མ་ཡིན་པས།
en: When it comes to this Dharma discourse, the Lord himself arranges the seat because it is a unique discourse.

source: འདིའི་སྟན་ཡང་ང་ཉིད་ཀྱིས་གདིང་བར་ནུས་སུ་ཟད་ན། བཤད་པ་ལྟ་ཅི་སྨོས་ཞེས་བསྟན་པའི་ཕྱིར་རོ།
en: It shows: “Only I myself can be comfortable on this, so it goes without saying only I can give the discourse.”

source: །གཞན་ཡང་འདིར་འདུལ་བ་མང་དུ་འདུལ།
en: Furthermore, here he tames many who have to be tamed.

source: དེ་དག་གི་མོས་པ་དང་། བསམ་པ་ཡང་ཐ་དད་དེ། དེ་བས་ན་དེ་དག་ཐམས་ཅད་དང་མཐུན་པར་གདན་བཤམ་པར་བྱ་བའི་ཕྱིར་ཡང་ཉིད་ཀྱིས་གདན་བཤམས་སོ།
en: They have different beliefs and aspirations, so he himself arranges his seat to make a seating arrangement in harmony with them all.

source: །ཆོས་ཀྱི་གདན་ལ་ཡང་རྣམ་པ་གསུམ་དུ་བཤད་དེ། ལུས་ཤིན་ཏུ་སྦྱངས་པ་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་ལུས་བསྒོམ་པ་དང་མཐུན་པར་སྐྱིལ་མོ་ཀྲུང་བཅས་པ་དང་། སེམས་ཤིན་ཏུ་སྦྱངས་པ་བསྐྱེད་པའི་ཕྱིར། སེམས་བསྒོམ་པ་དང་མཐུན་པར་སྐུ་དྲང་པོར་བསྲང་བ་དང་། རྩེ་གཅིག་ཏུ་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་བསྒོམ་པ་དང་མཐུན་པར་དྲན་པ་མངོན་དུ་གཞག་པ་རྣམས་སོ།
en: It also explains the Dharma posture in three parts: in harmony with physical meditation he sits cross-legged because physical pliancy has to be produced; in harmony with mental meditation the body is erect because mental pliancy has to be produced; and in harmony with meditative stabilization there is a direct application of mindfulness because there has to be single-pointedness.

source: །ཅིའི་ཕྱིར་གུས་པ་མཛད་པ་བསྟན་ཞེ་ན།
en: Why does it teach that he focuses his mind?

source: འདི་གུས་པ་བསྟན་པ་ནི་མ་ཡིན་གྱི་གང་འདི་ལྟ་བུ་ཉིད་དུ་བཞུགས་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རང་བཞིན་ཏེ།
en: He is not in fact focusing his mind. It is in the nature of tathāgatas that they abide in this way, not otherwise.

source: གཞན་དུ་ནི་མ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་རྟག་ཏུ་མཉམ་པར་གཞག་པ་ཡིན་མོད་ཀྱི་སྤྱོད་ལམ་གྱིས་འདུལ་བ་རྣམས་ལ་འདི་བསྟན་པས་དོན་དུ་འགྱུར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱང་དེ་ལྟ་བུའི་སྤྱོད་ལམ་གྱིས་བཞུགས་ན། བདག་ཅག་གིས་དེ་ལྟར་བྱ་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཞེས་གཞན་དག་ཀྱང་དེ་བཞིན་དུ་བྱེད་པར་འགྱུར་རོ།། །།
en: Even though tathāgatas are always in equipoise they demonstrate this conduct for those to be trained, so it has a purpose because it causes others to think, “If even the lords abide in such a practice it goes without saying that we should do so as well.”

source: བམ་པོ་གསུམ་པ། གླེང་གཞི་འདི་ཡང་རྣམ་པ་གསུམ་གྱིས་སྟོན་ཏེ། ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་དང་། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་། ཆོས་སྣང་བའི་ཆོ་འཕྲུལ་གྱིས་སོ།
en: This introduction, furthermore, teaches in three ways: with miraculous powers of meditative stabilization, miraculous wonder-working powers, and miraculous dharma-illuminating powers.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་ནི་ཏིང་ངེ་འཛིན་གཉིས་ཀྱི་དབང་གིས་རྣམ་པ་གཉིས་ཏེ། ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་དང་། ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་ཆོ་འཕྲུལ་ལོ།
en: Among these, the miraculous power of meditative stabilization is twofold based on two meditative stabilizations: the miraculous power of the meditative stabilization called the samādhirāja, and the miraculous power of the meditative stabilization called the siṃhavikrīḍita.

source: །རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཡང་རྣམ་པ་གཉིས་ཏེ། སྤྲུལ་པའི་ཆོ་འཕྲུལ་དང་། བྱིན་གྱི་རླབས་ཀྱི་ཆོ་འཕྲུལ་ལོ།
en: There are also two miraculous wonder-working powers: wonder-working by means of magical creation and wonder-working by means of sustaining power.

source: །ཆོས་སྣང་བའི་ཆོ་འཕྲུལ་ཡང་རྣམ་པ་གཉིས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བསྟན་པའི་ཆོ་འཕྲུལ་དང་། འཁོར་སྡུད་པའི་ཆོ་འཕྲུལ་ལོ།
en: And there are two miraculous dharma-illuminating powers as well: the miraculous power of teaching in many world systems, and the miraculous power of assembling a retinue.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་པའི་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་གདན་སེང་གེའི་ཁྲི་དེ་ཉིད་ལ་བཞུགས་ཞེས་བྱ་བའི་བར་གྱིས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་བསྟན་ཏོ། །སེང་གེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་ལུས་འདི་ཅི་འདྲ་བ་དེ་དང་མཐུན་པར་སྐུ་ཐ་མལ་པ་བསྟན་ཏོ་ཞེས་བྱ་བའི་བར་གྱིས་ནི་སེང་གེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་བསྟན་ཏོ།
en: Among these, starting from entered into the meditative stabilization, samādhirāja by name, up to then the Lord, seated on that very lion throne, teaches the miraculous power of the samādhirāja meditative stabilization; and from entered into the meditative stabilization called “siṃhavikrīḍita” up to thereupon the Lord exhibited an ordinary bodily form, like that of beings in the great billionfold world system teaches the miraculous power of the siṃhavikrīḍita meditative stabilization.

source: །སྐུ་ཅི་འདྲ་བ་དེ་བཞིན་དུ་བསྟན་ཏོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ་གཏོར་རོ། །མངོན་པར་གཏོར་རོ། །རབ་ཏུ་གཏོར་རོ་ཞེས་བྱ་བའི་བར་གྱིས་ནི་སྤྲུལ་པའི་ཆོ་འཕྲུལ་བསྟན་ཏོ། །ཁང་པ་བརྩེགས་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཚད་ཙམ་དེར་དེ་གནས་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ་དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་གདན་སེང་གེའི་ཁྲི་དེ་ཉིད་ལ་བཞུགས་བཞིན་དུ་ཞེས་བྱ་བའི་བར་གྱིས་ནི་བྱིན་གྱི་རླབས་ཀྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་བསྟན་ཏོ། །དེ་ནས་ཡང་ཞལ་འཛུམ་པ་མཛད་དོ།
en: From “exhibited an ordinary bodily form, like that…” up to strewed near, strewed in front, and strewed all around and so on teaches wonder-working by means of magical creation; then, from stayed there like a second story made of flowers and so on, with the dimensions of the great billionfold world system up to thereupon the Lord, seated on this very lion throne teaches wonder-working by means of sustaining power.

source: །ཞེས་བྱ་བ་ནས་བཟུང་སྟེ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་ཐབས་ཅིག་ཏུ་བཞུགས་པ་མཐོང་བར་གྱུར་ཞེས་བྱ་བའི་བར་གྱིས་ནི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བསྟན་པའི་ཆོ་འཕྲུལ་བསྟན་ཏོ། །དེ་ནས་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། །དེའི་ཚེ་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ་རྣམས་ཐུགས་སུ་ཆུད་ནས་ཞེས་བྱ་བའི་བར་གྱིས་ནི་འཁོར་སྡུད་པའི་ཆོ་འཕྲུལ་བསྟན་ཏོ།
en: Then, from smiled once again up to saw… the Tathāgata Śākyamuni, together with his community of monks and together with a retinue of bodhisattvas teaches the miraculous power of teaching in many world systems; and from then in the east, beyond as many world systems as the sand particles in the Gaṅgā River up to when the Lord understood that the world with its celestial beings, Māras and so on, teaches the miraculous power of assembling a retinue.

source: །དེ་ལ་ད་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་བསྟན་ཏེ། དེ་ཡང་རྣམ་པ་བཞིས་བསྟན་ཏེ། ཡན་ལག་དང་ཉིང་ལག་ནས་འོད་ཟེར་རྣམ་པར་བཀྱེ་བ་དང་། སྤུའི་ཁུང་བུ་ནས་འོད་ཟེར་རྣམ་པར་བཀྱེ་བ་དང་། རང་བཞིན་གྱི་འོད་ཟེར་རྣམ་པར་བཀྱེ་བ་དང་།
en: Now, in regard to these, the teaching about the miraculous power of the samādhirāja meditative stabilization is a teaching in four parts: radiating light from the major and minor parts of the body, radiating light from the pores of the body, radiating natural light, and radiating light from the tongue.

source: ལྗགས་ཀྱི་དབང་པོ་ལས་འོད་ཟེར་རྣམ་པར་བཀྱེ་བས་སོ། །ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ་ཞེས་བྱ་བ་ལ་དེ་བཞིན་གཤེགས་པ་ཅིའི་ཕྱིར་མཉམ་པར་འཇོག །
en: In regard to “entered into the meditative stabilization, samādhirāja by name,” why does the Tathāgata enter into meditative equipoise?

source: ཅི་མཉམ་པར་མ་བཞག་པར་སྒྲུབ།
en: Does he accomplish anything while not in meditative equipoise?

source: མི་སྤྱོད་དམ་ཞེ་ན་མི་སྤྱོད་པ་ནི་མ་ཡིན་གྱི།
en: Does he not practice?

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་གཡེང་བར་སྤྱོད་པ་ལ་དགྱེས་པ་མ་ཡིན་ལ་མཛེས་པ་ཡང་མ་ཡིན་པས། རྟག་ཏུ་མཉམ་པར་བཞག་པའི་ཕྱིར།
en: It is not that tathāgatas do not practice, but tathāgatas do not delight in distraction, which is not becoming, so they are always in meditative equipoise.

source: འདི་ལྟར་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་ཉིད་དོ།
en: Thus, being absorbed in meditative stabilization like this is their natural state.

source: །ཅིའི་ཕྱིར་ཏིང་ངེ་འཛིན་དེ་ཉིད་ལ་མཉམ་པར་གཞག་ལ། གཞན་མ་ཡིན་ཞེ་ན།
en: And why has he entered into just this meditative stabilization and not some other?

source: ཏིང་ངེ་འཛིན་འདི་ནི་དོན་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ་ཡིན་ཏེ།
en: Because this meditative stabilization accomplishes all aims.

source: དེའི་ཕྱིར་འདི་སྐད་དུ་ཏིང་ངེ་འཛིན་གང་དུ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཆུད་པ་དང་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says the meditative stabilization… in which all meditative stabilizations are put.

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སོ་སོའི་བྱ་བ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཏིང་ངེ་འཛིན་འདི་གཅིག་པུ་ཁོ་ནས་སྒྲུབ་པར་ནུས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that just this one meditative stabilization is able to accomplish all of the activities of every other individual meditative stabilization completely.

source: །འདུས་པ་དང་།
en: And it says included, and by being encompassed come to meet.

source: འུབ་ཀྱིས་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བ་ལ་ངོ་བོ་ཉིད་ཀྱིས་ནི་འདུས་པར་འགྱུར་རོ།
en: They are “included” because of their intrinsic nature; they “come to meet” because of their work.

source: །བྱ་བས་ནི་ཡང་དག་པར་གཞོལ་བར་འགྱུར་རོ། །ཏིང་ངེ་འཛིན་དེའི་ཡོན་ཏན་རྒྱས་པར་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་མདོ་ལས་རིག་པར་བྱའོ།
en: The good qualities of this meditative stabilization can be known in detail from the sūtra called The King of Samādhis Sūtra.

source: །དེ་བས་ན་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བར་ངེས་པའི་ཚིག་གིས་ཀྱང་བསྟན་པ་ཡིན་ནོ།
en: Hence, with the name king of meditative stabilizations it is taught through a creative explanation as well.

source: །ཏིང་ངེ་འཛིན་འདི་ལྟ་བུ་ཞིག །
en: With what is such a meditative stabilization accompanied?

source: གང་དང་མཚུངས་པར་ལྡན། མཚན་ཉིད་ཇི་ལྟ་བུ་ཞེ་ན།
en: What kind of mark does it have?

source: རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་དང་། དགའ་བ་དང་བདེ་བ་རྣམས་དང་བྲལ་བའོ། །བཏང་སྙོམས་དང་མཚུངས་པར་ལྡན་པའོ། །གཡོ་བ་མེད་པའི་མཚན་ཉིད་དོ།
en: It is free from applied and sustained thought, and from joy and happiness; it is accompanied by equanimity; and its mark is immovability.

source: །དེ་ལྟ་ན་གོ་བསམ་གཏན་བཞི་པའོ་ཞེས་ཅིའི་ཕྱིར་མ་བརྗོད་ཅེ་ན།
en: Why, then, is it not called the “fourth concentration”?

source: དང་པོ་དང་། གཉིས་པ་དང་། གསུམ་པ་རྣམས་ལས་ལྟོས་ནས། བཞི་པ་ཞེས་བརྗོད་པར་ཟད་ཀྱི།
en: The “fourth” is just an expression contingent on a first, second, and third.

source: དེ་བཞིན་གཤེགས་པ་ནི་དགོས་པ་བླ་སྐྱེས་མེད་པར་རིམ་གྱིས་མཉམ་པར་གཞག་པ་ལ་སྙོམས་པར་མི་འཇུག་སྟེ། དེ་ནས་དང་པོ་ལ་སོགས་པ་མེད་པས་བསམ་གཏན་བཞི་པ་ཞེས་བྱ་བའི་མིང་ཐོབ་པར་མི་འགྱུར་རོ།
en: In the absence of anything higher that has to be produced, tathāgatas do not enter absorption into meditative equipoises in a series, so there is no “first” and so on, and hence it does not get the name “fourth.”

source: །ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ནི་གཡོ་བ་མེད་པའི་ཉི་ཚེ་ཙམ་གྱི་མཚན་ཉིད་ཡིན་པས་གཡོ་བ་མེད་པ་ཞེས་བྱ་བར་བརྗོད་དོ།
en: The samādhirāja is stated to be “not moving” because it is marked by the mere partial immovability.

source: །ཏིང་ངེ་འཛིན་དེ་ནི་གཟུགས་ན་སྤྱོད་པ་མ་ཡིན། འདོད་པ་ན་སྤྱོད་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ་ན་སྤྱོད་པ་ཡང་མ་ཡིན་གྱི།
en: That meditative stabilization is not enjoyed in the form, desire, or formless realms.

source: དེ་ནི་ཟག་པ་མེད་པ་བཏང་སྙོམས་དང་ལྡན་པ། སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་ལ་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: It is called “meditative stabilization” because it is accompanied by equanimity without outflows and is in the form of a single-pointed mind.

source: །དེ་ཡང་བྱ་བའི་བྱེ་བྲག་ཉིད་ཀྱིས་དཔའ་བར་འགྲོ་བ་དང་། སེང་གེ་རྣམ་པར་རོལ་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་དང་། ཆོས་ཐམས་ཅད་ལས་འཕགས་པ་དང་། སྤྱི་གཙུག་བལྟར་མི་སྣང་བ་ཞེས་བྱ་བ་ལ་སོགས་པའི་མིང་དུ་བརྗོད་དུ་ཟད་ཀྱི།
en: Furthermore, based on specific actions they are simply given different names such as śūraṅgama, siṃhavikrīḍita, samādhirāja, sarva­dharmātikramaṇa, vilokita­mūrdhan, and so on.

source: རང་བཞིན་ཐ་དད་པར་དབྱེ་བ་ནི་མེད་དོ།
en: There is no division into different entities.

source: །དེ་ལྟར་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་བསྟན་ནས་ད་ནི་ཡན་ལག་དང་ཉིང་ལག་ནས་འོད་ཟེར་རྣམ་པར་འཕྲོ་བ་བསྟན་པའི་ཕྱིར། སྐུ་ཐམས་ཅད་ཀྱིས་འཛུམ་པ་མཛད་དོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: First, radiating light from the major and minor parts of the body Having thus taught the entrance into meditative stabilization, to teach that light radiates out from the major and minor limbs of the body it says he beamed with his whole body.

source: །འཛུམ་པ་ཞེས་བྱ་བ་ནི་འདིར་ཁ་འབྱེ་བ་ལ་བྱ་སྟེ། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ནས་འོད་ཟེར་འབྱུང་དུ་རུང་བར་མཛད་ནས་རྒྱས་པར་མཛད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Here, take “beamed” as unfurled, in the sense of making it possible for light rays to emerge and radiate out from all the major and minor limbs.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ནི་ངས་འདི་ལྟར་བྱའོ་སྙམ་དུ་རྩོལ་བ་དེ་ལྟ་བུ་དེ་མི་མངའ་མོད་ཀྱི། དགོས་པ་ཞིག་ཡོད་ན་ཏིང་ངེ་འཛིན་གྱི་མཐུ་ལས་དེ་ལྟ་དེ་ལྟ་བུ་མངོན་པར་འགྲུབ་སྟེ།
en: Tathāgatas do not exert themselves by thinking, “I am going to do it,” but rather, when there is a need for something, they accomplish it through the force of their meditative stabilization.

source: ཏིང་ངེ་འཛིན་རྣམས་ནི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཤུགས་ཀྱིས་ཡོངས་སུ་ཟིན་པའི་ཕྱིར་རོ།
en: The force of the previous prayer that is a vow has fully taken hold of the meditative stabilization.

source: །ཡང་དག་པར་སྡུད་པར་བྱེད་པ་རྣམས་ཀྱིས་དེ་ལྟར་ཤེས་ནས་ཐ་སྙད་དུ་རུང་བར་བྱ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་ལྟར་མཛད་དོ། འདི་སྐད་བཀའ་སྩལ་ཏོ་ཞེས་ཐ་སྙད་དུ་བཏགས་པར་རིག་པར་བྱའོ།
en: You should know that those who recite the Buddha’s words have such knowledge and use such locutions as “the Tathāgata did that” and “the Tathāgata said that” just to make it conventionally acceptable.

source: །འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་དྲུག་ཅུ་འབྱུང་ངོ་ཞེས་བྱ་བ་ལ་ཞབས་ཀྱི་མཐིལ་གཉིས་ཡོད་པའི་ཕྱིར་དྲུག་ཅུ་དྲུག་ཅུ་ཞེས་ལན་གཉིས་སུ་བརྗོད་དོ།
en: Issued sixty sixty-one hundred thousand one hundred million billion rays— the “sixty” is repeated twice because there are the two soles of his feet.

source: །འོ་ན་དྲུག་ཅུ་ཞེས་བྱ་བའི་ངེས་པ་ནི་ཅི་དགོས།
en: But why does it say exactly sixty?

source: འོད་ཟེར་མང་བ་དང་། གདུལ་བ་མང་བ་དང་། དགོས་པ་མང་བའི་ཕྱིར་གྲངས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཞེས་བྱ་བ་ནི་འོས་ན།
en: There are so many light rays, so many to train, so many needs that it would be right to say “a hundred thousand one hundred million billion.”

source: ཅིའི་ཕྱིར་གྲངས་དྲུག་ཅུ་ཞེས་བྱ་བར་ངེས་པར་བྱས་ཤེ་ན་དེ་ནི་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་གྱི་རང་བཞིན་ནི། ཁ་དོག་རྣམ་པ་དྲུག་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་།
en: So why does it specify exactly sixty?

source: དམར་པོ་དང་།
en: Understand as follows.

source: དཀར་པོ་དང་། ལེ་བརྒན་དང་། འོད་གསལ་བའོ། །འོད་ཟེར་ཁ་དོག་དྲུག་པོ་དེ་དག་ཕྱོགས་བཅུར་རྣམ་པར་འཕྲོས་པས་ན། ཕྱོགས་བཅུ་ཐ་དད་པས་དྲུག་ཅུར་གྱུར་པའི་ཕྱིར་དེ་སྐད་ཅེས་བྱའོ།
en: It is said that the light rays of a tathāgata are, by nature, in six colors: blue, yellow, red, white, saffron, and clear light, and when light rays of those six colors radiate out into the ten directions, because of the ten different directions they become sixty.

source: །འོ་ན་འོད་ཟེར་གཅིག་བྱུང་བས་དོན་ཐམས་ཅད་སྒྲུབ་མི་ནུས་སམ་ཅིའི་ཕྱིར་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ནས་འོད་ཟེར་འབྱུང་ཞེ་ན།
en: But the emergence of a single light ray is capable of accomplishing all aims, is it not? So why do light rays emerge from all the major and minor limbs? Indeed.

source: དེ་ཡང་བདེན་མོད་ཀྱི་འོན་ཀྱང་བཤད་པ་ལ་བསྟི་སྟང་ཆེར་མཛད་པར་བསྟན་པའི་ཕྱིར་རྩོལ་བ་ཆེན་པོ་མཛད་པ་བསྟན་ཏོ།
en: But still a great exertion is exhibited in order to demonstrate a great show of respect for the discourse.

source: །དཔལ་བེའུ་ལས་ཞེས་བྱ་བ་ནི་ཐུགས་ཀའི་ཕྱོགས་ནས་དཔལ་བེའུ་དང་། བཀྲ་ཤིས་ལ་སོགས་པའི་མཚན་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་དག་པ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མངའོ།
en: From the śrīvatsa mark— great bodhisattvas and tathāgatas have symbols such as the śrīvatsa, the svastika, and so on in their heart region.

source: །འོད་ཟེར་དེ་དག་གི་ལས་ནི་རྣམ་པ་གཉིས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་སྣང་བར་བྱེད་པའི་ལས་ཅན་དང་། སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པའི་ལས་ཅན་ཏེ།
en: These light rays do two types of work: they do the work of illuminating world systems and they do the work of helping beings.

source: དེ་ཡང་རིམ་བཞིན་དུ་མདོ་ཉིད་ལས་བསྟན་ཏོ།
en: The Sūtra itself teaches them sequentially.

source: །འདི་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ལ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་གྱུར་པར་ཤེས་པར་བྱའོ།
en: They became irreversible from the unsurpassed, perfect, complete awakening. In regard to this, you should know they become irreversible through the power of the previous prayers of the lord buddhas.

source: །སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་ཞེས་བྱ་བ་འདི་ཡང་གུས་པ་བསྟན་པ་ཉིད་ཀྱི་ཕྱིར་ཏེ། དད་པས་རྗེས་སུ་འབྲང་བ་ཕྱིས་འབྱུང་བ་རྣམས་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པས་སྤུའི་ཁུང་བུ་རེ་རེ་ནས་འོད་ཟེར་འདི་ལྟ་བུ་དག་ཕྱུང་སྟེ།
en: Second, radiating light from the pores of the body Thereupon all the Lord’s hair pores— this too is just to show respect, because faith-followers who come afterward will think, “The Tathāgata radiates light rays like this from each of his hair pores, that is, he gives this discourse having shown it great respect.”

source: གུས་པ་ཆེར་མཛད་ནས་འདི་བཤད་དོ་སྙམ་ནས་དེས་ཀྱང་དུས་ཕྱི་མ་པ་རྣམས་དད་པ་སྐྱེས་པའི་ཕྱིར་ཕན་བཏགས་པར་འགྱུར་རོ།
en: So, it is helpful to those at a later time because it gives rise to faith.

source: །འོད་ཟེར་དེ་དག་གི་ལས་ཀྱང་རྣམ་པ་གཉིས་སུ་རིག་པར་བྱའོ།
en: You should know these light rays also do two types of work.

source: །དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་གྱི་འོད་ཀྱིས་ཞེས་བྱ་བ་ལ་འོད་དང་། འོད་ཟེར་གཉིས་ལ་ཁྱད་པར་ཅི་ཡོད་ཅེ་ན།
en: Third, radiating natural light What is the difference between a tathāgata’s natural splendor and light rays?

source: ནང་ནས་བྱུང་བ་ལ་ནི་འོད་ཟེར་ཅེས་བྱའོ། །ཕྱིའི་པགས་པ་ལས་བྱུང་བ་ལ་ནི་འོད་ཅེས་བྱའོ།
en: Light rays come from within; splendor comes from the outer skin.

source: །ཡང་ན་ཡེ་ཤེས་རྣམ་པར་འཕྲོ་བ་ལས་བྱུང་བ་ལ་ནི་འོད་ཟེར་ཅེས་བྱའོ། །ཁ་དོག་རྣམ་པར་འཕྲོ་བ་ལས་བྱུང་བ་ནི་འོད་ཅེས་བྱ་སྟེ། གཙུག་ལག་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་འོད་ཟེར་དག་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཆོས་ལ་ཡང་དག་པར་རིག་པའི་ཚེ་བྱུང་ངོ་ཞེས་གསུངས་སོ།
en: Alternatively, light rays come when knowledge radiates out; splendor comes when color radiates out, because the treatises also say that a buddha’s light rays arise when the Dharma is perfectly understood at the site of awakening.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཆོས་སྟོན་པ་ན། ཕལ་ཆེར་སྔ་ནས་འདི་ལྟ་བུའི་ཆོས་ཤིག་བཤད་དོ་སྙམ་དུ་བརྩལ་མ་ཐག་ཏུ་འོད་ཟེར་རྣམས་འབྱུང་བར་འགྱུར་རོ་ཞེས་མདོ་ལས་བཤད་དོ།
en: And a sūtra says, “The moment they are stirred by the thought, ‘When lord buddhas teach the Dharma, most previously have explained such a Dharma as this,’ light rays emerge.”

source: །དེ་ལྟ་བས་ན་ནང་ནས་ཡེ་ཤེས་ཀྱི་སྣང་བ་འབྱུང་བས་ན་འོད་ཟེར་ཡང་འབྱུང་བར་རིག་པར་བྱའོ།
en: So, you should know that when the light of knowledge emerges from within, light rays also arise.

source: །རང་བཞིན་གྱི་འོད་ཀྱི་ལས་ཀྱང་རྣམ་པ་གཉིས་ཡོད་པར་ཤེས་པར་བྱའོ།
en: And you should be aware that natural light also does the two types of work.

source: །ལྗགས་ཀྱིས་སྣང་བར་མཛད་པའི་ཆོ་འཕྲུལ་ནི་ཆོས་བསྟན་པའི་ཕྱིར་སྔ་ལྟས་ཉིད་དུ་བསྟན་པ་སྟེ།
en: Fourth, radiating light from the tongue The miraculous power of illumination with the tongue is demonstrated to presage the teaching of Dharma.

source: ལྗགས་ཀྱི་དབང་པོ་ལས་འོད་ཟེར་བྱུང་བ་ཡང་ཆོས་བསྟན་པའི་ལྟས་ཡིན་ནོ།
en: The radiance from the tongue also signifies the teaching of Dharma.

source: །འོད་ཟེར་དེ་དག་ལས་པདྨ་བྱུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྐྱོན་མེད་པ་ལ་འཇུག་པར་ངེས་པའི་རྟགས་ཡིན་ནོ། །པདྨ་དེ་དག་ལས་སངས་རྒྱས་རྣམས་བྱུང་བ་དང་།
en: The emergence of lotuses from those light rays is a sign that bodhisattvas [who listen to the teaching] have definitely entered into flawlessness.

source: དེ་དག་ཆོས་སྟོན་པ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་པདྨ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཁ་བྱེ་བས་རྒྱས་ནས་ཕྱོགས་ཕྱོགས་སུ་འདི་ལྟ་བུའི་ཆོས་སྟོན་པར་འགྱུར་བའི་ལྟས་ཡིན་ནོ།
en: The buddhas emerging from them and teaching Dharma signifies that those lotus bodhisattvas, when they bloom and grow into right and perfect complete awakening, will teach such Dharma in the different directions.

source: །ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཏིང་ངེ་འཛིན་གྱི་ཆོ་འཕྲུལ་གཉིས་བསྟན་ཏོ།
en: He entered into the meditative stabilization called siṃhavikrīḍita and so on teaches the two miraculous powers of meditative stabilization.

source: །ཆོ་འཕྲུལ་འདི་ཡང་སྣོད་ཀྱི་འཇིག་རྟེན་བྱི་དོར་བྱ་བ་དང་། སེམས་ཅན་གྱི་འཇིག་རྟེན་ལ་ཕན་གདགས་པ་དང་རྣམ་པ་གཉིས་སུ་བསྟན་ཏོ།
en: These miraculous powers, furthermore, show the twin aspects of cleansing the container world and helping the world of inhabitant beings.

source: །སྣོད་ཀྱི་འཇིག་རྟེན་བྱི་དོར་བྱ་བ་ནི་བཤད་པ་ལ་མཆོད་པའི་ཕྱིར་རོ།
en: The activity of cleansing the container world is for worship of the discourse.

source: །བྱི་དོར་བྱ་བ་དེ་ལ་ཡང་རྣམ་པ་ལྔས་བསྟན་ཏེ། གཡོ་བ་དང་། འགུལ་བ་དང་། ལྡེག་པ་དང་། མཐོ་བ་དང་།
en: The demonstration of this cleansing is in five parts: shaking, quaking, stirring, rising, and sinking.

source: དམའ་བའོ།
en: Among these is shaking.
